Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Finally, thanks to Larry Wall, without whom none of this would be necessary.
es_es: Finalmente, gracias a Larry Wall, sin el cual, nada de esto sería necesario.

source: # parse mail messages
es_es: # analizar mensajes de correo

source: =head1 New Documentation
es_es: =head1 Nueva documentación

source: =item read FILEHANDLE,SCALAR,LENGTH
es_es: =item read IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD

source: # In the main program
es_es: # En el programa principal

source: If FILEHANDLE is an expression, the value is taken as the name of the filehandle.
es_es: Si IDENTIFICADOR_ARCHIVO es una expresión, el valor es tomado como el nombre del identificador.

source: In particular, C<@DB::args> might have information from the previous time C<caller> was called.
es_es: En particular, C<@DB::args> podría tener información de la llamada a la anterior llamada a C<caller>.

source: See L<perlfunc/vec> for information on how to manipulate individual bits in a bit vector.
es_es: Vea L<perlfunc/vec> para obtener información sobre cómo manipular bits individuales de un vector de bits.

source: Options may exist at multiple protocol levels depending on the socket type, but at least the uppermost socket level SOL_SOCKET (defined in the C<Socket> module) will exist.
es_es: Opciones pueden existir en múltiples niveles de protocolo dependiendo del tipo de socket, pero al menos existirá el más alto nivel de socket SOL_SOCKET (definido en el módulo C<Socket>).

source: User-defined subroutines may choose to care whether they are being called in a void, scalar, or list context.
es_es: Las subrutinas definidas por el usuario tienen la opción de considerar si están siendo llamadas en contexto vacío, escalar o de lista.

source: Reads or writes the System V shared memory segment ID starting at position POS for size SIZE by attaching to it, copying in/out, and detaching from it.
es_es: Lee o escribe en el segmento ID de memoria compartida System V a partir de la posición POSICIÓN para el tamaño TAMAÑO, añadiéndose a ella, copiando la entrada/salida, y desuniéndose de ella.

source: Besides being used internally during the build process of the Encode module, you can use F<enc2xs> to add your own encoding to perl.
es_es: F<enc2xs> se usa internamente durante el proceso de compilación del módulo Encode; también lo puede usar para agregar su propia codificación a perl.

source: On some platforms (notably DOS-like ones), the shell may not be capable of dealing with multiline commands, so putting newlines in the string may not get you what you want.
es_es: En algunas plataformas (especialmente las de tipo DOS), el shell quizás no pueda ser capaz de tratar con los comandos de múltiples líneas, así que poner saltos de línea quizás no le permita obtener lo que quiere.

source: Returns the value of a symbolic link, if symbolic links are implemented.
es_es: Devuelve el valor de un enlace simbólico, si los enlaces simbólicos están implementados.

source: =head2 Subscripts
es_es: =head2 Subíndices

source: It has the information about the modules (with their versions) included with each release of Perl.
es_es: Este módulo contiene información sobre los módulos (con sus versiones) incluidos en cada versión de Perl.

source: This is applicable to the third and fourth arguments of C<sysread>, for example.
es_es: Esto es aplicable, por ejemplo, a los argumentos tercero y el cuarto de C<sysread>.

source: You may find the length of array @days by evaluating C<$#days>, as in B<csh>.
es_es: Puede conocerse la longitud del array @días evaluando C<$#días>, como en B<csh>.

source: See L<perlre> for further explanation on these.
es_es: Ver L<perlre> para una explicación más detallada sobre esto.

source: Sequence Value
es_es: Secuencia Valor

source: Due to the commutativity breakage, code references are no longer treated specially when appearing on the left of the C<~~> operator, but like any vulgar scalar.
es_es: Debido a la rotura de la conmutatividad, las referencias a código ya no se tratan de forma especial cuando aparecen a la izquierda del operador C<~~>, sino que son tratadas como cualquier otro valor escalar.

source: See also C<POSIX::setsid()>.
es_es: Vea también C<POSIX::setsid()>.

source: CPAN stands for Comprehensive Perl Archive Network, a multi-gigabyte archive replicated on hundreds of machines all over the world.
es_es: CPAN es la sigla de Comprehensive Perl Archive Network, un repositorio que ocupa muchos gigabytes y está replicado en cientos de equipos del planeta.

source: The number after Perl (i.e. the 5 after Perl 5) is the major release of the perl interpreter as well as the version of the language.
es_es: El número que va detrás de Perl (el 5 de Perl 5) es la versión principal del intérprete de Perl (es decir, perl), así como la versión del lenguaje.

source: It may also be useful in places where the "grab all you can, and do not give anything back" semantic is desirable.
es_es: También puede ser útil en lugares donde la semántica "agarra todo lo que puedas, y no dar nada a cambio" sea deseable.

# perl -C0 -ne 'printf "%v02X ", $_ for unpack("U0A*", $_)'
source: perl -C0 -ne 'printf "%v02X\n", $_ for unpack("U0A*", $_)'
es_es: perl -C0 -ne 'printf "%v02X\n", $_ for unpack("C0A*", $_)'

source: Here's a subroutine that does substring:
es_es: Aquí hay una subrutina que parte cadenas:

source: my $logmessage = $_[0]; # uncommon, and ugly
es_es: my $mensaje_registro = $_[0]; # poco común (y poco estético)

source: BUILD
es_es: COMPILACIÓN

source: ($name,$passwd,$uid,$gid,
es_es: ($nombre,$contrasena,$uid,$gid,

source: Negation of a true value by C<!> or C<not> returns a special false value.
es_es: La negación del valor de verdadero con C<!> o C<not> devuelve un valor falso especial.

source: THIS
es_es: ESTE

source: B A bit string (descending bit order inside each byte).
es_es: B Un cadena de bit (en orden de bit descendente dentro de cada byte).

source: Previously this blocking was in effect also for programs executed from within Perl.
es_es: Anteriormente, este bloqueo se encontraba en vigor también para los programas ejecutados desde dentro de Perl.

source: Recursion is of unlimited depth.
es_es: La profundidad de recursión es ilimitada.

source: The C<< > >> or C<< < >> modifiers can only be used on floating-point formats on big- or little-endian machines.
es_es: Los modificadores C<< > >> o C<< < >> solo pueden ser usados con formatos de punto flotante en máquinas con ordenación big-endian o little-endian.

source: Math::Currency for currency calculations
es_es: Math::Currency para cálculos monetarios

source: perldgux - Perl under DG/UX.
es_es: perldgux - Perl bajo DG/UX.

source: 'unknown';
es_es: 'desconocido';

source: JAPH stands for "Just another Perl hacker,", which Randal Schwartz used to sign email and usenet messages starting in the late 1980s.
es_es: JAPH significa "Just another Perl hacker". A finales de los ochenta, Randal Schwartz empezó a utilizar esta firma en mensajes de correo electrónico y usenet.

source: =head1 NAME
es_es: =head1 NOMBRE

source: B<There may be no deprecation warning for v-strings>, though: it is quite hard to detect when v-strings are being used safely, and when they are not.
es_es: Sin embargo, B<puede no haber advertencias con los v-strings>: es muy difícil detectar cuándo los v-strings se están utilizando de forma segura, y cuándo no.

source: Alternatives are tried from left to right, so the first alternative found for which the entire expression matches, is the one that is chosen.
es_es: Las alternativas son procesadas de izquierda a derecha, de modo que la primera alternativa encontrada que coincida con toda la expresión, es la que es elegida.

source: or for using call-by-named-parameter to complicated functions:
es_es: o para utilizar llamadas con parámetros por nombre para funciones complicadas:

source: When using ExtUtils::MakeMaker, you can use "make dist" to create your package.
es_es: Cuando se utiliza ExtUtils::MakeMaker, puede usar "make dist" para crear el paquete.

source: DIRHANDLE may be an expression whose value can be used as an indirect dirhandle, usually the real dirhandle name.
es_es: IDENTIFICADOR_DIR puede ser una expresión cuyo valor puede ser usado como un identificador de directorio indirecto, normalmente el nombre real del identificador.

source: [ "fred", "barney" ],
es_es: [ "pedro", "pablo" ],

source: Thus the following will not match forever: X<\G>
es_es: Así, lo siguiente no coincidirá nunca: X<\G>

source: or how about sorted by key:
es_es: o de forma ordenada por la clave:

source: Note that myname() functions as a list operator, not as a unary operator; so be careful to use C<or> instead of C<||> in this case.
es_es: Note que minombre() funciona como un operador de lista, no como un operador unario; cuidado al usar C<or> en vez de C<||> en este caso.

source: C<undef> indicates that the search position is reset (usually due to match failure, but can also be because no match has yet been run on the scalar).
es_es: C<undef> indica que la posición de búsqueda se restablece (generalmente debido a un error de coincidencia, pero también puede ser porque aún no ha sido ejecutada la coincidencia sobre el escalar).

source: An old feature of perl was that before C<require> or C<use> look for a file with a F<.pm> extension, they will first look for a similar filename with a F<.pmc> extension.
es_es: Una vieja característica de perl antes de que C<require> o C<use> busquen por un archivo con una extensión F<.pm>, antes buscará por un nombre de archivo similar con una extensión F<.pmc>.

source: Changes to these modules should be submitted to the maintainer of the CPAN module.
es_es: Los cambios realizados en estos módulos deben enviarse al mantenedor del módulo de CPAN.

source: {3,6} matches between 3 and 6 of the previous thing
es_es: {3,6} detecta entre 3 y 6 coincidencias de lo anterior

source: C<mkdir()> without arguments now defaults to C<$_>.
es_es: C<mkdir()> sin argumentos ahora se refiere a C<$_>.

source: These utilities help manage extra Perl modules that don't come with the perl distribution.
es_es: Estas utilidades ayudan a administrar módulos Perl adicionales que no se incluyen en la distribución de perl.

source: for $value (LIST) {
es_es: for $valor (LISTA) {

source: Returns the number of processes successfully signaled (which is not necessarily the same as the number actually killed).
es_es: Devuelve el número de procesos señalados exitosamente (que no es necesariamente el mismo número de los llamados).

source: A warning is emitted if the C<use warnings> pragma or the B<-w> command-line flag (that is, the C<$^W> variable) was set.
es_es: Una advertencia es emitida si están activos el pragma C<use warnings> o la opción en línea de comandos B<-w> (es decir, la variable C<$^W>).

source: This had been broken since version 5.10.0.
es_es: Esto se había roto desde la versión 5.10.0.

source: The exceptions are substitution (s///) and transliteration (y///) with the C</r> (non-destructive) option, which cause the B<r>eturn value to be the result of the substitution.
es_es: Las excepciones son las sustituciones (s///) y la transliteración (y///) con la opción C</r> (no destructiva), que hace B<r>egresar como valor, el resultado de la sustitución.

source: For unpack(), nybbles are converted to a string of hexadecimal digits.
es_es: Para unpack(), los nibles se convierten en una cadena de dígitos hexadecimales.

source: In some cases, it may be a chain of identifiers, separated by C<::> (or by the slightly archaic C<'>); all but the last are interpreted as names of packages, to locate the namespace in which to look up the final identifier (see L<perlmod/Packages> for details).
es_es: En ciertos casos, puede ser una serie de identificadores separados por C<::> (o por el ligeramente arcaico C<'>); donde todos los identificadores menos el último se interpretan como nombres de paquetes que determinan el espacio de nombres en el que se buscará el identificador final (vea L<perlmod/Packages> para obtener los detalles).

# C<say LIST> is simply an abbreviation for C<{ local $ = " "; print LIST }>.
source: C<say LIST> is simply an abbreviation for C<{ local $\ = "\n"; print LIST }>.
es_es: C<say LISTA> es simplemente una abreviatura de C<{ local $\ = "\n"; print LISTA }>.

source: If symbolic links are unimplemented on your system, a normal C<stat> is done.
es_es: Si los enlaces simbólicos no están implementados en su sistema, se hace un C<stat> normal.

source: C<threads> will now honour C<no warnings 'threads'>
es_es: C<threads> ahora activará C<no warnings 'threads'>

source: Compare L</split>.
es_es: Compare con L</split>.

source: perluniintro Perl Unicode introduction
es_es: perluniintro Introducción a Unicode

# print "JA" | " ph "; # prints "japh "
source: print "JA" | " ph\n"; # prints "japh\n"
es_es: print "JA" | " ph\n"; # imprime "japh\n"

source: $off, $width, $bits, $val, $res
es_es: $despl, $ancho, $bits, $val, $res

source: If package name is omitted, the C<main> package as assumed.
es_es: Si el nombre del paquete se omite, se asume que es C<main>.

source: Perl has a mechanism for intermixing documentation with source code.
es_es: Perl tiene un mecanismo para entremezclar documentación y código fuente.

source: X<number, literal>
es_es: X<number, literal> X<número, literal>

source: perl5132delta Perl changes in version 5.13.2
es_es: perl5132delta Cambios en la versión 5.13.2

source: =head2 $^X doesn't always contain a full path in FreeBSD
es_es: =head2 $^X no siempre contiene el camino completo en FreeBSD

source: For example, to set the top-of-form format for more than one output channel, you might do the following:
es_es: Por ejemplo, si tiene que fijar la parte superior del formato de un formulario para más de un canal de salida, puede hacer lo siguiente:

source: Otherwise arguments are converted to floating point format and the floating point result is used.
es_es: De lo contrario, los argumentos se convierten al formato de punto flotante y se usa el resultado de punto flotante.

source: Within a C<foreach> or a C<given>, a C<default> BLOCK acts like a C<when> that's always true.
es_es: Dentro de un C<foreach> o un C<given>, un BLOQUE C<default> actúa como un C<when> que siempre es verdadero (siempre se ejecuta).

source: a regular expression match, i.e. C</REGEX/> or C<$foo =~ /REGEX/>, or a negated regular expression match (C<!/REGEX/> or C<$foo !~ /REGEX/>).
es_es: una coincidencia con una expresión regular, es decir, C</REGEX/> o C<$foo =~ /REGEX/>, o una negación de una coincidencia con una expresión regular (C<!/REGEX/> o C<$foo !~ /REGEX/>).

source: X<string, literal>
es_es: X<string, literal> X<cadena, literal>

source: to use long longs for the 64-bit integer type, in case you don't have a 64-bit CPU.
es_es: para usar enteros largos para los tipos enteros de 64 bit, en caso de que no tenga una CPU de 64 bit.

source: Thus C<last> can be used to effect an early exit out of such a block.
es_es: Así, C<last> puede ser usado para salir prematuramente de este bloque.

source: =item fcntl FILEHANDLE,FUNCTION,SCALAR X<fcntl>
es_es: =item fcntl IDENTIFICADOR_ARCHIVO,FUNCIÓN,ESCALAR X<fcntl>

source: Because this promotes action at a distance, this counterintuitive behavior may be fixed in a future release.
es_es: Debido a que provoca una acción extraña a gran distancia, este comportamiento no intuitivo puede ser arreglado en una futura distribución.

source: In particular, calling keys() in void context resets the iterator with no other overhead.
es_es: De forma particular, llamando a keys() en contexto nulo (void) resetea el iterador sin otro efecto.

source: C<undef> is always treated as numeric, and in particular is changed to C<0> before incrementing (so that a post-increment of an undef value will return C<0> rather than C<undef>).
es_es: C<undef> es tratado siempre como numérico, y, en particular, es cambiado a C<0> antes de incrementar (de modo que un post-incremento de un valor undef devolverá C<0> en lugar de C<undef>).

source: =head2 The Triple-Dot Operator X<...> X<... operator> X<yada-yada operator> X<whatever operator> X<triple-dot operator>
es_es: =head2 El operador Triple Punto X<...> X<... operator> X<yada-yada operator> X<operador lo-que-sea> X<operador triple punto>

source: Name of the MRO, either in ISO-8859-1 or UTF-8.
es_es: Nombre de la MRO, ya sea en ISO-8859-1 o UTF-8.

source: || (gripe(), next LINE);
es_es: || (gripe(), next LINEA);

source: It prevents perl from creating an empty scalar with every new typeglob.
es_es: Evita que perl cree un escalar vacío con cada nuevo typeglob.

source: Don't re-invent the wheel
es_es: No vuelva a reinventar la rueda

source: For ease of access, the Perl manual has been split up into several sections.
es_es: Para facilitar el acceso, el manual de perl se ha dividido en varias secciones.

source: Its rather blunt control of the underlying algorithm may not persist into future Perls, but the ability to characterize the input or output in implementation independent ways quite probably will.
es_es: Su contundente control del algoritmo subyacente quizás no persista en versiones futuras de Perl, pero la capacidad para caracterizar la entrada o salida en implementaciones independientes muy probablemente lo hará.

source: See the bottom of L<perlfunc/"open FILEHANDLE"> for an example.
es_es: Ver la parte inferior de L<perlfunc/"open IDENTIFICADOR_ARCHIVO"> para un ejemplo.

source: @b = (@a)[0,1]; # @b has no elements
es_es: @b = (@a)[0,1]; # @b no tiene elementos

source: An inner block may countermand this by saying C<no strict 'subs'>.
es_es: Un bloque interno puede revocar esto diciendo C<no strict 'subs'>.

source: NAME
es_es: NOMBRE

source: Because you have to read a file to do the C<-T> test, on most occasions you want to use a C<-f> against the file first, as in C<next unless -f $file && -T $file>.
es_es: Debido a que tiene que leer el archivo para hacer el test C<-T>, en la mayoría de las ocasiones querrá usar primero C<-f>, como en C<next unless -f $archivo && -T $archivo>.

source: =head1 DESIGNING AND WRITING YOUR MODULE
es_es: =head1 DISEÑANDO Y ESCRIBIENDO SU MÓDULO

source: Furthermore, C<"span" ..
es_es: Por otra parte, C<"span" ..

source: See the personal note at the end of the README file in the perl source distribution for more details.
es_es: Para obtener más información, consulte la nota personal que se incluye al final del archivo README de la distribución del código fuente de perl.

source: The filename passed to the one- and two-argument forms of open() will have leading and trailing whitespace deleted and normal redirection characters honored.
es_es: Al nombre del archivo pasado a las formas de uno y dos argumentos de open() se le eliminarán los espacios en blanco iniciales y finales, y se activará la redirección por parte de los caracteres especiales.

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://bugs.perl.org/.
es_es: Si usted encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://bugs.perl.org/.

source: C<length undef> now returns undef.
es_es: C<length undef> ahora devuelve undef.

source: die "/etc/games is no good, stopped";
es_es: die "/etc/games no está bien, parado";

source: In this and the following steps, the "2>&1 | tee XXX.out" records all output from the process, which will be useful if anything unexpected goes wrong.
es_es: En este y los siguientes pasos, el "2>&1 | tee XXX.out" registra toda la salida del proceso, que será útil si algo inesperado va mal.

source: @ones = (1) x 80; # a list of 80 1's
es_es: @unos = (1) x 80; # una lista de 80 unos

source: This is different from the C interfaces, which return C<-1> on failure.
es_es: Esto es diferente de las interfaces en C, que devuelven C<-1> en caso de error.

source: Any simple statement may optionally be followed by a I<SINGLE> modifier, just before the terminating semicolon (or block ending).
es_es: Cualquier instrucción simple puede ser seguida opcionalmente por un I<ÚNICO> modificador, justo antes del punto y coma final (o del final del bloque).

source: printf '<%e>', 10; # prints "<1.000000e+01>"
es_es: printf '<%e>', 10; # imprime "<1.000000e+01>"

source: It didn't really fail to match anything.
es_es: No ha fallado al corresponder con cualquier cosa.

source: $output = `cmd 3>&1 1>&2 2>&3 3>&-`;
es_es: $salida = `comando 3>&1 1>&2 2>&3 3>&-`;

source: # require 5.14 for when as statement modifier
es_es: # requiere 5.14 para usar when como un modificador de instrucción

source: The C<feature> pragma is used to enable new syntax that would break Perl's backwards-compatibility with older releases of the language.
es_es: El pragma C<feature> se utiliza para activar una nueva sintaxis que rompe la compatibilidad Perl con versiones anteriores del lenguaje.

source: Here's an example showing the behavior for boundary cases:
es_es: Aquí un ejemplo que muestra el comportamiento para los casos límite:

source: I.e. do:
es_es: Es decir, haga:

source: This pragma establishes an ISA relationship with base classes at compile time.
es_es: Este pragma establece una relación ISA con clases base en tiempo de compilación.

source: The file is created with permissions of C<0666> modified by the process's C<umask> value.
es_es: El archivo se crea con permisos de C<0666> modificados por el valor de C<umask> del proceso.

source: =head3 Character Classes and other Special Escapes
es_es: =head3 Clase carácter y otros escapados especiales

source: This allows distribution authors to specify configuration prerequisites that must be installed before running F<Makefile.PL> or F<Build.PL>.
es_es: Esto permite a los autores de la distribución especificar los requisitos previos de configuración que deben estar instalados antes de ejecutar F<Makefile.PL> o F<Build.PL>.

source: The Perl test suite may still report some errors on the Hurd.
es_es: El conjunto de pruebas de Perl podría detectar errores en Hurd.

source: perlhack Perl hackers guide
es_es: perlhack Guía para hackers

source: Most text file processing can be done a line at a time with Perl's looping constructs.
es_es: Gran parte de las tareas de procesamiento de archivos de texto se puede hacer de línea en línea con las estructuras de bucle de Perl.

source: It really does shift the @ARGV array and put the current filename into the $ARGV variable.
es_es: Realmente, desplaza el array @ARGV y pone el nombre del archivo actual en la variable $ARGV.

source: The result is the character specified by the octal number between the braces.
es_es: El resultado es el carácter especificado por el número octal entre las llaves.

# chomp; # avoid on last field
source: chomp; # avoid \n on last field
es_es: chomp; # evitar \n en el último campo

source: open(my $out, ">", "output.txt") or die "Can't open output.txt: $!";
es_es: open(my $salida, ">", "salida.txt") or die "No se puede abrir salida.txt: $!";

source: Perl is at the mercy of your machine's definitions of various operations such as type casting, atof(), and floating-point output with sprintf().
es_es: Perl depende de las definiciones de hardware para diversas operaciones, como la conversión de tipos, atof() o la salida de números de punto flotante con sprintf().
